Revit 2024 API
Wall.RemoveProfileSketch Method
 Reverts an edited wall to its original shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public void RemoveProfileSketch()
Visual Basic
Public Sub RemoveProfileSketch
Visual C++
public:
void RemoveProfileSketch()
Remarks
 The wall profile is changed back to its original rectangular profile. All profile changes made in the sketch mode are discarded. To check if wall sketch can be removed call SketchId.
See Also
Wall Class
Autodesk.Revit.DB Namespace